[options]
mode bmc
depth 8
expect timeout,pass,fail
timeout 900
aigsmt none

[engines]
smtbmc boolector
# smtbmc yices
# abc sim3

[script]
--pycode-begin--
output("verilog_defines -Dmutidx=%s" % task)
--pycode-end--
read_verilog -sv bmc.sv
read_ilang mutated.il
prep -top bmc
fmcombine bmc reference mutated
flatten
opt -fast

[files]
bmc.sv
mutated.il
