design -reset
read_verilog tinybmat.v
synth -flatten -top tinybmat
abc -g cmos4
tee -o stats_tinybmat_asic.txt stat
tee -a stats_tinybmat_asic.txt ltp -noff

design -reset
read_verilog tinybmat.v
synth -flatten -top tinybmat
abc -lut 4
tee -o stats_tinybmat_fpga.txt stat
tee -a stats_tinybmat_fpga.txt ltp -noff
