design -reset
read_verilog simplebmat.v
synth -flatten -top simplebmat
abc -g cmos4
tee -o stats_simplebmat_asic.txt stat
tee -a stats_simplebmat_asic.txt ltp -noff

design -reset
read_verilog simplebmat.v
synth -flatten -top simplebmat
abc -lut 4
tee -o stats_simplebmat_fpga.txt stat
tee -a stats_simplebmat_fpga.txt ltp -noff
